Darrieus/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         12.99361154; //39 Rev (omega = -18.85882353)

deltaT          0.00092547091; //1 deg

writeControl    timeStep;

writeInterval   30; //every 30 deg

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression    off;

timeFormat      general;

timePrecision   16;

runTimeModifiable   true;

adjustTimeStep  no; 

maxCo   2;

functions
{
	#include    "forces"
	#include    "surfaces"
	#include    "probes"
}

// ************************************************************************* //
