Darrieus/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh; //solidBodyMotionFvMesh;

motionSolverLibs    ("libfvMotionSolvers.so" );

motionSolver    solidBody;

cellZone        FLUID_ROTOR;

solidBodyMotionFunction    rotatingMotion;

origin        (0 0 0);
axis          (0 0 1);
omega         -18.85882353; // rad/s


// ************************************************************************* //
