Darrieus/system/forces.cfg
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

type            forces;
libs            ("libforces.so");

writeControl    timeStep;
writeInterval   1;

log             yes;

// ************************************************************************* //
