Darrieus/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
|  \\    /   O peration     | Version:  plus                                  |  
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

probes2
{

    type    probes;
    libs    ("libsampling.so");

    writeControl    timeStep;
    writeInterval   1;

    fields (U k p);
    setFormat   raw;

    probeLocations
    (
        (0.0000     -0.8000 0)    // circle Rint = 0.8m
        (-0.3061	-0.7391 0)
        (-0.5657	-0.5657 0)
        (-0.7391	-0.3061 0)
        (-0.8000	0.0000 0)
        (-0.7391	0.3061 0)
        (-0.5657	0.5657 0)
        (-0.3061	0.7391 0)
        (0.0000	    0.8000 0)
        (0.3061	    0.7391 0)
        (0.5657	    0.5657 0)
        (0.7391	    0.3061 0)
        (0.8000	    0.0000 0)
        (0.7391	   -0.3061 0)
        (0.5657	   -0.5657 0)
        (0.3061	   -0.7391 0)
        
        (0.0000	    -0.9000 0)    // circle Rout = 0.9m
        (-0.3444	-0.8315 0)
        (-0.6364	-0.6364 0)
        (-0.8315	-0.3444 0)
        (-0.9000	0.0000 0)
        (-0.8315	0.3444 0)
        (-0.6364	0.6364 0)
        (-0.3444	0.8315 0)
        (0.0000	    0.9000 0)
        (0.3444	    0.8315 0)
        (0.6364	    0.6364 0)
        (0.8315    	0.3444 0)
        (0.9000	    0.0000 0)
        (0.8315	    -0.3444 0)
        (0.6364    	-0.6364 0)
        (0.3444	    -0.8315 0)

    );

}

// ************************************************************************* //
